<template>
	<div id="SexHabits" style="width: 30%;height: 100%;">
	</div>
</template>

<script>
	import $ from 'jquery'
	import axios from 'axios'
	import * as echarts from 'echarts'
	import * as d3 from 'd3v4'
	export default {
		name: "SexHabits",
		data() {
			return {}
		},
		methods: {},
		mounted() {
			var myChart = echarts.init(document.getElementById('SexHabits'));

			var myData = [];

			for(let i = 0; i < 24; i++) {
				if(i < 10)
					myData.push(" " + i.toString() + "    ")
				else
					myData.push(i.toString() + "    ")
			}
			/*zy 12/18 后五个网吧改成了收纳未成年人上网人数前五的网吧*/
			var man_from_0_to_17 = {
				1: [266, 107, 85, 48, 35, 51, 82, 90, 160, 212, 319, 339, 740, 735, 616, 470, 492, 476, 501, 567, 546, 501, 400, 287],
				2: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				7: [26, 7, 4, 5, 6, 21, 30, 11, 6, 2, 2, 12, 9, 14, 10, 11, 9, 9, 12, 33, 36, 14, 16, 16],
				8: [18, 4, 1, 1, 0, 0, 0, 0, 7, 2, 9, 9, 15, 22, 14, 16, 25, 13, 18, 17, 22, 10, 9, 19],
				9: [1, 1, 0, 0, 0, 0, 1, 1, 2, 9, 15, 11, 64, 9, 13, 28, 24, 8, 13, 6, 6, 1, 1, 2],
				10: [6, 2, 5, 0, 0, 0, 0, 1, 3, 4, 10, 12, 28, 5, 19, 13, 18, 12, 8, 7, 10, 13, 12, 8],
				11: [11, 3, 1, 0, 1, 0, 0, 0, 1, 2, 3, 10, 27, 27, 23, 11, 9, 16, 8, 24, 13, 7, 5, 7]
			}
			var man_from_18_to_25 = {
				1: [30173, 16768, 12573, 8689, 6012, 4715, 4288, 6361, 17119, 22884, 27958, 33676, 56706, 67799, 67368, 58775, 55809, 59149, 90875, 101655, 86446, 70628, 53335, 36190],
				2: [329, 183, 215, 87, 148, 90, 144, 73, 81, 80, 116, 160, 280, 395, 417, 486, 439, 567, 595, 670, 512, 569, 473, 416],
				3: [160, 87, 93, 62, 58, 60, 55, 66, 60, 77, 97, 106, 154, 202, 198, 252, 257, 261, 257, 339, 353, 241, 286, 180],
				4: [189, 104, 85, 84, 58, 40, 18, 17, 24, 62, 67, 95, 103, 119, 158, 151, 133, 147, 151, 201, 182, 151, 168, 112],
				5: [141, 70, 49, 35, 17, 12, 6, 21, 51, 96, 132, 181, 330, 377, 313, 241, 243, 315, 367, 279, 242, 278, 288, 287],
				6: [94, 56, 43, 23, 14, 7, 5, 6, 16, 50, 62, 63, 145, 224, 252, 231, 187, 205, 269, 319, 277, 196, 167, 113],
				7: [16, 16, 9, 8, 11, 35, 29, 7, 16, 5, 11, 20, 29, 27, 29, 33, 20, 28, 50, 76, 89, 42, 26, 18],
				8: [11, 11, 5, 4, 2, 0, 0, 2, 6, 15, 21, 26, 46, 41, 38, 43, 33, 28, 36, 29, 33, 37, 15, 17],
				9: [31, 9, 8, 4, 2, 0, 1, 0, 9, 12, 27, 25, 51, 37, 44, 25, 36, 22, 33, 44, 59, 39, 34, 23],
				10: [39, 32, 26, 16, 17, 5, 6, 8, 13, 30, 40, 56, 102, 74, 79, 86, 60, 57, 73, 87, 74, 78, 54, 45],
				11: [10, 6, 6, 3, 1, 1, 3, 2, 4, 9, 12, 8, 22, 27, 18, 19, 12, 15, 15, 19, 19, 18, 18, 5]
			};
			var man_from_26_to_35 = {
				1: [13249, 7343, 5342, 3634, 2537, 2078, 2175, 5093, 13641, 20429, 23102, 25451, 39135, 41646, 39954, 35026, 31192, 32225, 48613, 54462, 43557, 32040, 21477, 14927],
				2: [13, 11, 5, 5, 6, 6, 5, 2, 10, 12, 13, 9, 17, 19, 22, 27, 23, 27, 23, 18, 34, 23, 21, 27],
				3: [97, 42, 35, 21, 26, 18, 18, 25, 51, 49, 62, 61, 101, 106, 116, 159, 166, 126, 132, 180, 216, 189, 185, 151],
				4: [92, 49, 42, 25, 28, 16, 9, 7, 13, 49, 49, 67, 97, 110, 107, 94, 87, 81, 97, 120, 80, 101, 62, 51],
				5: [4, 2, 0, 0, 0, 0, 1, 0, 1, 3, 3, 7, 6, 3, 11, 4, 5, 10, 10, 6, 6, 7, 8, 7],
				6: [13, 1, 3, 0, 1, 1, 0, 0, 1, 7, 7, 7, 25, 29, 29, 33, 23, 21, 48, 44, 36, 28, 22, 6],
				7: [4, 1, 3, 2, 3, 6, 3, 0, 1, 1, 2, 3, 5, 3, 4, 8, 4, 2, 10, 16, 15, 8, 3, 2],
				8: [9, 8, 1, 0, 0, 1, 0, 1, 8, 16, 24, 24, 36, 22, 18, 25, 16, 18, 12, 18, 27, 15, 12, 4],
				9: [8, 4, 3, 3, 3, 1, 2, 2, 6, 16, 14, 12, 22, 20, 19, 26, 24, 18, 31, 21, 21, 24, 17, 13],
				10: [27, 16, 15, 8, 9, 3, 4, 13, 17, 29, 31, 34, 41, 39, 29, 41, 36, 26, 36, 49, 35, 34, 26, 25],
				11: [6, 3, 2, 0, 0, 0, 1, 2, 4, 6, 17, 8, 20, 9, 8, 16, 13, 10, 14, 17, 14, 7, 11, 6]
			};
			var man_from_36_to_60 = {
				1: [5829, 3216, 2423, 1732, 1278, 1020, 1281, 2819, 7093, 9925, 10123, 10486, 16219, 16646, 15338, 13279, 12061, 11614, 14920, 16794, 13452, 10590, 8095, 6403],
				2: [2, 0, 2, 0, 1, 0, 0, 0, 2, 5, 9, 2, 1, 6, 7, 7, 2, 4, 6, 6, 5, 2, 3, 1],
				3: [8, 8, 3, 4, 6, 2, 3, 5, 6, 8, 9, 10, 5, 16, 22, 17, 23, 22, 22, 45, 32, 27, 24, 22],
				4: [17, 8, 5, 5, 2, 1, 0, 0, 4, 21, 18, 22, 12, 15, 13, 9, 17, 18, 10, 18, 18, 13, 16, 4],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 2, 1, 1, 1, 0, 1, 0, 0, 0, 5, 5, 4, 4, 1, 2, 2, 1, 2, 8, 6, 3, 2, 1],
				7: [0, 1, 0, 0, 2, 1, 0, 0, 1, 0, 1, 0, 2, 1, 0, 0, 2, 1, 2, 0, 4, 0, 1, 0],
				8: [2, 2, 3, 1, 1, 1, 0, 0, 2, 4, 8, 7, 8, 6, 10, 3, 8, 4, 10, 4, 2, 6, 10, 2],
				9: [2, 2, 2, 1, 1, 0, 0, 2, 5, 10, 5, 9, 16, 10, 13, 12, 6, 8, 8, 11, 5, 10, 5, 2],
				10: [12, 5, 12, 4, 5, 2, 0, 1, 4, 9, 10, 21, 24, 16, 29, 19, 12, 27, 12, 22, 14, 7, 2, 7],
				11: [9, 4, 5, 2, 2, 1, 1, 0, 6, 4, 1, 9, 7, 21, 8, 12, 8, 9, 3, 8, 4, 4, 3, 8]
			};
			var man_more_than_60 = {
				1: [119, 88, 59, 42, 16, 21, 45, 98, 184, 245, 243, 229, 479, 476, 424, 328, 322, 324, 356, 419, 289, 290, 222, 150],
				2: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				7: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				8: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				9: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				10: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				11: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
			};

			var woman_from_0_to_17 = {
				1: [17, 8, 9, 4, 5, 3, 1, 0, 9, 7, 13, 67, 213, 106, 158, 100, 103, 69, 103, 74, 70, 71, 49, 31],
				2: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				7: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				8: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				9: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 6, 61, 10, 10, 29, 17, 7, 14, 4, 2, 2, 2, 0],
				10: [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 13, 19, 2, 20, 8, 17, 10, 8, 4, 8, 14, 1, 1],
				11: [0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 8, 27, 0, 5, 0, 0, 0, 8, 0, 7, 0, 0, 0]
			};
			var woman_from_18_to_25 = {
				1: [17244, 8128, 5654, 3383, 2013, 1134, 923, 1190, 5562, 8052, 10329, 14870, 30989, 42343, 44553, 38823, 37306, 37771, 60223, 73044, 61862, 49313, 34855, 20958],
				2: [327, 175, 183, 83, 134, 44, 122, 0, 8, 51, 116, 153, 267, 390, 418, 471, 438, 547, 594, 670, 508, 570, 466, 349],
				3: [150, 63, 66, 35, 50, 26, 56, 65, 59, 63, 97, 105, 127, 162, 114, 244, 258, 222, 255, 321, 335, 210, 225, 170],
				4: [182, 105, 74, 83, 27, 11, 11, 16, 15, 56, 68, 88, 91, 88, 147, 142, 127, 145, 152, 196, 173, 144, 164, 110],
				5: [133, 19, 37, 11, 13, 0, 0, 1, 48, 97, 124, 142, 270, 378, 311, 200, 215, 296, 361, 259, 218, 268, 201, 279],
				6: [95, 56, 40, 21, 12, 2, 0, 0, 17, 48, 51, 55, 145, 223, 250, 231, 187, 206, 268, 320, 277, 192, 167, 114],
				7: [0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 3, 6, 0, 0, 0, 0, 0, 0, 0, 0],
				8: [0, 5, 0, 5, 0, 0, 0, 1, 2, 0, 0, 18, 39, 39, 35, 42, 33, 0, 33, 30, 30, 36, 9, 9],
				9: [0, 5, 6, 1, 0, 0, 0, 0, 0, 2, 2, 0, 49, 23, 38, 21, 33, 12, 25, 36, 38, 31, 26, 0],
				10: [21, 31, 8, 1, 0, 4, 0, 7, 13, 24, 41, 50, 100, 33, 60, 56, 52, 52, 30, 75, 72, 48, 36, 34],
				11: [0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 6, 11, 24, 11, 10, 0, 6, 8, 17, 20, 0, 0, 5]
			};
			var woman_from_26_to_35 = {
				1: [3575, 1624, 1083, 566, 362, 266, 254, 603, 2367, 4353, 5934, 6622, 13841, 15784, 16921, 13633, 11565, 11208, 17406, 22988, 18233, 12304, 7315, 4283],
				2: [8, 0, 3, 0, 0, 0, 1, 0, 0, 0, 2, 0, 0, 17, 0, 20, 21, 15, 12, 10, 25, 14, 11, 27],
				3: [0, 0, 0, 0, 19, 7, 10, 12, 0, 0, 37, 0, 0, 0, 79, 9, 159, 16, 0, 116, 206, 0, 163, 0],
				4: [86, 50, 35, 22, 26, 11, 6, 2, 9, 20, 41, 44, 43, 107, 106, 91, 87, 77, 96, 120, 61, 102, 61, 50],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 7, 0, 0],
				6: [0, 0, 1, 1, 0, 0, 0, 0, 0, 6, 6, 0, 10, 24, 18, 27, 15, 0, 43, 42, 33, 19, 17, 0],
				7: [0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 4, 0, 0, 2, 0, 0, 0, 0, 0, 0],
				8: [6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 0, 18, 21, 19, 13, 0, 1, 5, 0, 0, 0, 13, 0],
				9: [3, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 12, 10, 10, 0, 21, 22, 2, 27, 7, 22, 0, 0, 0],
				10: [0, 0, 0, 0, 0, 0, 0, 0, 18, 24, 14, 14, 32, 22, 26, 23, 18, 1, 16, 20, 26, 27, 0, 0],
				11: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 0, 18, 8, 5, 0, 14, 1, 8, 18, 0, 0, 0, 0]
			};
			var woman_from_36_to_60 = {
				1: [2030, 1031, 716, 471, 324, 255, 454, 925, 2216, 3645, 4005, 4099, 8234, 8700, 7858, 6673, 5788, 5324, 6278, 7474, 5826, 4664, 3499, 2617],
				2: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 0, 0, 0],
				4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 0, 0, 4, 10, 0, 6, 5, 5, 6, 0, 0, 0],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 2, 3, 1, 0, 0, 1, 3, 3, 0],
				7: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				8: [0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 9, 0, 8, 7, 10, 0, 0, 0, 0, 2, 3, 6, 0, 0],
				9: [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 12, 0, 0, 13, 7, 0, 0, 0, 0, 0, 0, 0],
				10: [3, 6, 6, 3, 6, 0, 0, 2, 0, 9, 10, 14, 17, 10, 0, 0, 7, 24, 13, 18, 6, 8, 2, 1],
				11: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 0, 5, 0, 0, 0, 3, 1, 4, 5, 0, 0]
			};
			var woman_more_than_60 = {
				1: [79, 50, 36, 18, 9, 11, 22, 50, 105, 136, 130, 151, 290, 272, 227, 210, 166, 166, 153, 178, 146, 148, 141, 104],
				2: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				5: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				6: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				7: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				8: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
				9: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				10: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
				11: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0]
			};

			// 修改堆砌图的颜色
			var colors = ["rgb(200, 220,240)", "rgb(160, 190,220)", "rgb(120, 160,200)", "rgb(80, 130,180)", "rgb(40, 100,160)"];

			var timeLineData = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11];
			var croll = ['所有网吧', '50010610009083', '50011310000099', '50010510000124', '50010910000192', '50010910000062', '50010510000200', '50010510000005', '50010510000131', '50010510000070', '50010510000010']
			var option = {
				baseOption: {
					//backgroundColor: '#000',
					timeline: {
						show: true,
						axisType: 'category',
						tooltip: {
							show: true,
							formatter: function(params) {
								// console.log(params);
								return croll[Number(params.name) - 1];
							}
						},
						autoPlay: false,
						currentIndex: 0,
						playInterval: 1500,
						label: {
							normal: {
								show: true,
								interval: 'auto',
								formatter: function(params) {

									return croll[Number(params) - 1];
								},
							},
						},
						checkpointStyle: {
							color: "rgb(80, 130,180)",
							borderColor: 'rgb(120, 160,200)'
						},
						data: [],
					},
					title: {
						textStyle: {
							color: '#fff',
							fontSize: 16,
						},
						subtext: '',
					},
					legend: {
						data: ['0-17', '18-25', '26-35', '36-60', '60+'],
						top: 4,
						right: '5%',
						top: '5%',
						textStyle: {
							color: '#fff',
						},
					},
					tooltip: {
						show: true,
						trigger: 'axis',
						formatter: function(params) {
							// console.log(params[0]);
							return params[0].seriesName + "：&nbsp;&nbsp;" + params[0].value + "<br>" + params[1].seriesName + "：" + params[1].value + "<br>" +
								params[2].seriesName + "：" + params[2].value + "<br>" + params[3].seriesName + "：" + params[3].value + "<br>" +
								params[4].seriesName + "：&nbsp;&nbsp;&nbsp;" + params[4].value + "<br>";
						},
						axisPointer: {
							type: 'shadow',
						}
					},

					//					toolbox: {
					//						right: 20,
					//						feature: {
					//							//saveAsImage: {},
					//							//restore: {},
					//							//dataView: {},
					//							//dataZoom: {},
					//							// magicType: {
					//							//     type: ['line', 'bar']
					//							// },
					//							// brush: {},
					//						}
					//					},

					grid: [{
						show: false,
						left: '4%',
						top: 60,
						bottom: 60,
						containLabel: true,
						width: '47.4%',
					}, {
						show: false,
						left: '50.5%',
						top: 80,
						bottom: 60,
						width: '0%',
					}, {
						show: false,
						right: '4%',
						top: 60,
						bottom: 60,
						containLabel: true,
						width: '46%',
					}, ],

					xAxis: [{
						type: 'value',
						inverse: true,
						axisLine: {
							show: false,
						},
						axisTick: {
							show: false,
						},
						position: 'top',
						axisLabel: {
							show: true,
							textStyle: {
								color: '#B2B2B2',
								fontSize: 12,
							},
						},
						splitLine: {
							show: true,
							lineStyle: {
								color: '#1F2022',
								width: 1,
								type: 'solid',
							},
						},
					}, {
						gridIndex: 1,
						show: false,
					}, {
						gridIndex: 2,
						type: 'value',
						axisLine: {
							show: false,
						},
						axisTick: {
							show: false,
						},
						position: 'top',
						axisLabel: {
							show: true,
							textStyle: {
								color: '#B2B2B2',
								fontSize: 12,
							},
						},
						splitLine: {
							show: true,
							lineStyle: {
								color: '#1F2022',
								width: 1,
								type: 'solid',
							},
						},
					}, ],
					yAxis: [{
							type: 'category',
							inverse: true,
							position: 'right',
							axisLine: {
								show: false
							},
							axisTick: {
								show: false
							},
							axisLabel: {
								show: true,
								margin: 8,
								textStyle: {
									color: '#9D9EA0',
									fontSize: 14,
								},

							},
							data: myData,
						},
						{
							gridIndex: 1,
							type: 'category',
							inverse: true,
							position: 'left',
							axisLine: {
								show: false
							},
							axisTick: {
								show: false
							},
							axisLabel: {
								show: false,
								textStyle: {
									color: '#9D9EA0',
									fontSize: 12,
								},

							},
							data: myData.map(function(value) {
								return {
									value: value,
									textStyle: {
										align: 'center',
									}
								}
							}),
						},
						{
							gridIndex: 2,
							type: 'category',
							inverse: true,
							position: 'left',
							axisLine: {
								show: false
							},
							axisTick: {
								show: false
							},
							axisLabel: {
								show: false,
								textStyle: {
									color: '#9D9EA0',
									fontSize: 12,
								},

							},
							data: myData,
						}
					],

					series: [],

				},

				options: [],

			};

			for(var i = 0; i < timeLineData.length; i++) {
				option.baseOption.timeline.data.push(timeLineData[i]);
				option.options.push({
					title: {
						//text: croll[timeLineData[i] - 1] + '顾客年龄性别的上网时刻分布',
					},
					series: [{
							name: '0-17',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							stack: 'a',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'left',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									// 修改堆砌图颜色
									color: colors[0],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: man_from_0_to_17[timeLineData[i]]
						},
						{
							name: '18-25',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							stack: 'a',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'left',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[1],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: man_from_18_to_25[timeLineData[i]]
						},
						{
							name: '26-35',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							stack: 'a',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'left',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[2],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: man_from_26_to_35[timeLineData[i]]
						},
						{
							name: '36-60',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							stack: 'a',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'left',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[3],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: man_from_36_to_60[timeLineData[i]]
						},
						{
							name: '60+',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							stack: 'a',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'left',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[4],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: man_more_than_60[timeLineData[i]]
						},
						{
							name: '0-17',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							xAxisIndex: 2,
							yAxisIndex: 2,
							stack: 'b',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'right',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[0],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: woman_from_0_to_17[timeLineData[i]]
						},
						{
							name: '18-25',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							xAxisIndex: 2,
							yAxisIndex: 2,
							stack: 'b',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'right',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[1],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: woman_from_18_to_25[timeLineData[i]]
						},
						{
							name: '26-35',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							xAxisIndex: 2,
							yAxisIndex: 2,
							stack: 'b',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'right',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[2],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: woman_from_26_to_35[timeLineData[i]]
						},
						{
							name: '36-60',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							xAxisIndex: 2,
							yAxisIndex: 2,
							stack: 'b',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'right',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[3],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: woman_from_36_to_60[timeLineData[i]]
						},
						{
							name: '60+',
							type: 'bar',
							barGap: 20,
							barWidth: 13,
							xAxisIndex: 2,
							yAxisIndex: 2,
							stack: 'b',
							label: {
								normal: {
									show: false,
								},
								emphasis: {
									show: false,
									position: 'right',
									offset: [0, 0],
									textStyle: {
										color: '#fff',
										fontSize: 14,
									},
								},
							},
							itemStyle: {
								normal: {
									color: colors[4],
								},
								emphasis: {
									color: '#08C7AE',
								},
							},
							data: woman_more_than_60[timeLineData[i]]
						}

					]
				});
			}

			myChart.setOption(option);
		}
	}
</script>

<style>

</style>